## imports

In [1]:
import pandas

In [2]:
numbers = range(1,10)

In [5]:
squares = [x**2 for x in numbers]

In [6]:
cubes = [x**3 for x in numbers]

In [7]:
sdataframe = pandas.DataFrame({'Number' : numbers , 'Square' : squares})

In [8]:
cDataFrame = pandas.DataFrame({'Number' : numbers , 'Cubes' : cubes})

In [9]:
pandas.concat([sdataframe , cDataFrame] , axis = 1)

   Number  Square  Number  Cubes
0       1       1       1      1
1       2       4       2      8
2       3       9       3     27
3       4      16       4     64
4       5      25       5    125
5       6      36       6    216
6       7      49       7    343
7       8      64       8    512
8       9      81       9    729

In [10]:
pandas.DataFrame({"Index" : range(1,11)}).set_index("Index")

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [12]:
concatenated = pandas.concat(
               [
               pandas.DataFrame({"Number" : range(3,8)} , index = range(3,8)) , 
               pandas.DataFrame({"Square" : [x**2 for x in range(5,10)]} , index = range(5,10)) , 
               pandas.DataFrame({"Cube" : [x**3 for x in range(1,7)]} , index = range(1,7))
               ] , 
               axis = 1)

In [13]:
concatenated

   Number  Square   Cube
1     NaN     NaN    1.0
2     NaN     NaN    8.0
3     3.0     NaN   27.0
4     4.0     NaN   64.0
5     5.0    25.0  125.0
6     6.0    36.0  216.0
7     7.0    49.0    NaN
8     NaN    64.0    NaN
9     NaN    81.0    NaN

In [21]:
concatenated.dropna(subset = ['Number'])

   Number  Square   Cube
3     3.0     NaN   27.0
4     4.0     NaN   64.0
5     5.0    25.0  125.0
6     6.0    36.0  216.0
7     7.0    49.0    NaN

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]